app/controllers/api/v2/gains_controller.rb

    def show
        gain = current_user.gains.find(params[:id])
---
SELECT  `gains`.* FROM `gains` WHERE `gains`.`user_id` = 1 AND `gains`.`id` = 4 LIMIT 1