app/controllers/api/v2/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 17 LIMIT 1
---
    def show
        begin
            #Cria a variavel, recebe o usuario e respondde ele
            @user = User.find(params[:id])

INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `auth_token`, `uid`, `tokens`) VALUES ('super@1.com.br', '$2a$11$r6C4sZ.Lh6DSOaSCWHOQsuY.Vr0klfSf/PU7Mvaj/dFQs.fgiLuEW', '2019-04-25 20:50:23', '2019-04-25 20:50:23', 'oGK_xm9y1VsdoUzXx7SQ', 'super@1.com.br', '{}')
---
    def create
        user =  User.new(user_params)

        if user.save

UPDATE `users` SET `email` = 'novo@email.com', `uid` = 'novo@email.com' WHERE `users`.`id` = 26
---
    def update
        user = current_user

        if user.update(user_params)

DELETE FROM `users` WHERE `users`.`id` = 30
---
    def destroy
        current_user.destroy