app/controllers/api/v1/gains_controller.rb

    def show
        gain = current_user.gains.find(params[:id])
---
SELECT  `gains`.* FROM `gains` WHERE `gains`.`user_id` = 1 AND `gains`.`id` = 2 LIMIT 1

    def create
        gain = current_user.gains.build(gain_params)
        if gain.save
---
INSERT INTO `gains` (`description`, `value`, `date`, `user_id`, `created_at`, `updated_at`) VALUES ('Mesada', 100.0, '2019-03-20', 1, '2019-04-02 13:30:22', '2019-04-02 13:30:22')