app/controllers/api/v1/sessions_controller.rb

    def create
        user = User.find_by(email: sessions_params[:email])

        if user && user.valid_password?(sessions_params[:password])
            sign_in user, store: false
            user.generate_authentication_token!
            user.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'super@geeks.com' LIMIT 1
UPDATE `users` SET `auth_token` = 'G_wNb5YikniM1FMq8D9b', `updated_at` = '2019-04-01 19:46:46' WHERE `users`.`id` = 1