app/controllers/api/v1/users_controller.rb

    def show
        begin
            #Cria a variavel, recebe o usuario e respondde ele
            @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

    def create
        user =  User.new(user_params)

        if user.save
---
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `auth_token`, `uid`, `tokens`) VALUES ('super@1.com.br', '$2a$11$H2sJd65LMkFnsrjGLOiFeOj.YC9Hf4u/GcSq53jrg1zcQXgqOOE0C', '2019-04-25 20:29:46', '2019-04-25 20:29:46', 'JJfpxJ47r_yyZH2Xcz5x', 'super@1.com.br', '{}')

    def update
        user = User.find(params[:id])

        if user.update(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 10 LIMIT 1
UPDATE `users` SET `email` = 'novo@email.com', `uid` = 'novo@email.com' WHERE `users`.`id` = 11

    def destroy
        user = User.find(params[:id])
        user.destroy
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 14 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 14